// Создать с использованием js поле 6 на 6 клеток (черные - белые типо шахматной доски)
// Создать на поле  по 3 красные и синие фишки с номерами внутри 1,2,3
// Красные фишки могут стоять на свободных черных клетках
// Синие фишки могут стоять на свободных белых клетках
// эти фишки можно при помощи драг н дропа переносить по клеткам доски
// красные могут перемещаться только на свободные черные клетки, а синие на свободные белые
// сделать кнопку рест которая при клике перемещала все фишки в изначальное положение
// кнопка рандом которая расставляла фишки в случайном месте на поле но по правилам выше

// теория
// https://learn.javascript.ru/events
// https://developer.mozilla.org/ru/docs/Web/Events
